Revit 2024 API
BuiltInFailures.StairRampFailures.ContinuousRailSupportPlacementFailure Property
 Cannot place the supports along the rail path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ContinuousRailSupportPlacementFailure { get; }
Visual Basic
Public Shared ReadOnly Property ContinuousRailSupportPlacementFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ContinuousRailSupportPlacementFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace